电脑/html5/javascript语言/javascript语言学习基础篇.org
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:[11pt,oneside]
#+LATEX_HEADER: \usepackage{article}


#+TITLE: javascript学习基础篇
#+AUTHOR: 万泽(德山书生)
#+CREATOR: wanze(<a href="mailto:a358003542@163.com">a358003542@163.com</a>)
#+DESCRIPTION: 制作者邮箱：a358003542@gmail.com


* 前言
本文主要面向那些已经熟悉一门编程语言的读者，并不十分适合编程初学者来阅读。


* javascript语言简介
** 注释
用 ~//~ 来标记一行注释。
#+BEGIN_SRC js
// This is a comment that the computer will ignore. 
// It is for your eyes only!
#+END_SRC

用 ~/*   */~ 来标记多行注释，不过用 ~//~ 来标记多行注释也是可以的，这个看编辑器方不方便。

** javascript代码放在那里
javascript的代码一般推荐是放在 ~</body>~ 之前，这样能够让浏览器更快地加载页面。至于其他倒没有特别的要求，刚开始简单的javascript代码就直接写上去也是可以的:

#+BEGIN_EXAMPLE
<script>
your awesome javascript code
</script>
</body>
#+END_EXAMPLE

这样更方便早期的调试。如果javascript代码量有一点了那么当然还是推荐另外单独放在一个js文件上，然后如下引入进来:
#+BEGIN_EXAMPLE
<script src="where"></script>
#+END_EXAMPLE

然后一个网页内如果没有特别的理由的话，那么javascript代码最好就放在一个文件里面，方便网页加载。

** alert函数
弹出一段警告信息
#+BEGIN_EXAMPLE
alert("hello")
#+END_EXAMPLE

** console.log函数
不同于alert函数，这个函数是在开发者工具的控制台那里显示。更加方便调试和debug javascript程序。
#+BEGIN_EXAMPLE
console.log("hello")
#+END_EXAMPLE

** confirm函数
弹出一个对话框，可以和用户互动点击确定或取消。根据用户的点击返回true或false。
#+BEGIN_EXAMPLE
confirm('This is an example of using JS to create some interaction on a website. Click OK to continue!');
#+END_EXAMPLE

** prompt函数
弹出一个对话框，具体是一个输入框，输入的值就是该函数的返回值。
#+BEGIN_EXAMPLE
var age = prompt("what's your age");
#+END_EXAMPLE


** 数据类型简介
数值型，字符串型（javascript同python一样单引号双引号都可以），布尔型（javascript是 ~true~ 和 ~false~ ），然后其他常规数值运算和逻辑运算（如 ~&&~ ~||~ ~!~ 之类）和比较运算（这里值得一提的是和python的 ~==~ 对应的javascript的比较运算符应该是 ~===~ ，三个等号，这算是javascript的一个历史遗留语法瑕疵问题。）等都大体相同。python中的None对应的是javascript的 ~null~ 。

然后高级数据类型各个编程语言差异就很大了，不过javascript似乎和python在基本高级数据类型上也很接近，比如说javascript的数组就类似于python的列表:
#+BEGIN_EXAMPLE
[1, 2, 3.14, 'Hello', null, true];
#+END_EXAMPLE

其索引index编号法则也和python一致。

然后javascript还有一个什么对象的概念，其大体可以看作python中的字典类型。
#+BEGIN_EXAMPLE
var person = {
    name: 'Bob',
    age: 20,
    tags: ['js', 'web', 'mobile'],
    city: 'Beijing',
    zipcode: null
};
#+END_EXAMPLE

如下所示具体调用各个数值也是类似的:
#+BEGIN_EXAMPLE
person['name']
"Bob"
person.name
"Bob"
#+END_EXAMPLE




** 声明变量
很多资料都会谈论这个问题，javascript代码声明变量都推荐加上 ~var~ 这个关键词，如下所示。
#+BEGIN_SRC js
var x;
var count = 2;
#+END_SRC 
这样的话变量的作用域就很符合我们在其他编程语言中的常识，比如在函数里面就是局部变量等。

** typeof函数
相当于python中的 ~type~ 函数，查看某个对象的对象类型。

** 数值型简介
javascript整数和浮点数都不分了，都统一表示为Number，然后数值型那些运算，比如加减乘除之类的就不用多说了。其中 ~%~ 和python一样也是求余操作。在python3中有 ~5//2~ 是求商的概念，javascript没有这个概念，我们需要如下来获得类似的效果。

#+BEGIN_EXAMPLE
console.log(parseInt(5/2))
#+END_EXAMPLE


