电脑/html5/javascript语言/javascript语言学习基础篇.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-05-01 日 18:00 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>javascript学习基础篇</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">javascript学习基础篇</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 前言</a></li>
<li><a href="#orgheadline31">2. javascript语言简介</a>
<ul>
<li><a href="#orgheadline2">2.1. 注释</a></li>
<li><a href="#orgheadline3">2.2. javascript代码放在那里</a></li>
<li><a href="#orgheadline4">2.3. alert函数</a></li>
<li><a href="#orgheadline5">2.4. console.log函数</a></li>
<li><a href="#orgheadline6">2.5. confirm函数</a></li>
<li><a href="#orgheadline7">2.6. prompt函数</a></li>
<li><a href="#orgheadline8">2.7. 数据类型简介</a></li>
<li><a href="#orgheadline9">2.8. 声明变量</a></li>
<li><a href="#orgheadline10">2.9. typeof函数</a></li>
<li><a href="#orgheadline11">2.10. 数值型简介</a></li>
<li><a href="#orgheadline14">2.11. 字符串型简介</a>
<ul>
<li><a href="#orgheadline12">2.11.1. 多行字符串</a></li>
<li><a href="#orgheadline13">2.11.2. 字符串的一些方法清单</a></li>
</ul>
</li>
<li><a href="#orgheadline17">2.12. 数组</a>
<ul>
<li><a href="#orgheadline15">2.12.1. 数组的一些方法清单</a></li>
<li><a href="#orgheadline16">2.12.2. 比较两个数组是否相同</a></li>
</ul>
</li>
<li><a href="#orgheadline21">2.13. 对象类型简介</a>
<ul>
<li><a href="#orgheadline18">2.13.1. in语句</a></li>
<li><a href="#orgheadline19">2.13.2. delete语句</a></li>
<li><a href="#orgheadline20">2.13.3. hasOwnProperty方法</a></li>
</ul>
</li>
<li><a href="#orgheadline22">2.14. 布尔值</a></li>
<li><a href="#orgheadline23">2.15. null</a></li>
<li><a href="#orgheadline24">2.16. 条件判断结构</a></li>
<li><a href="#orgheadline26">2.17. 循环结构</a>
<ul>
<li><a href="#orgheadline25">2.17.1. while语句</a></li>
</ul>
</li>
<li><a href="#orgheadline27">2.18. 定义函数</a></li>
<li><a href="#orgheadline28">2.19. arguments用法</a></li>
<li><a href="#orgheadline29">2.20. rest用法</a></li>
<li><a href="#orgheadline30">2.21. 箭头函数</a></li>
</ul>
</li>
<li><a href="#orgheadline40">3. 面向DOM的操作</a>
<ul>
<li><a href="#orgheadline32">3.1. window</a></li>
<li><a href="#orgheadline33">3.2. navigator</a></li>
<li><a href="#orgheadline34">3.3. screen</a></li>
<li><a href="#orgheadline35">3.4. location</a></li>
<li><a href="#orgheadline39">3.5. document</a>
<ul>
<li><a href="#orgheadline36">3.5.1. getAttribute函数</a></li>
<li><a href="#orgheadline37">3.5.2. setAttribute函数</a></li>
<li><a href="#orgheadline38">3.5.3. 修改节点的文本内容</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline41">4. 表单相关</a></li>
<li><a href="#orgheadline42">5. AJAX技术</a></li>
<li><a href="#orgheadline50">6. 附录</a>
<ul>
<li><a href="#orgheadline43">6.1. windows加载事件</a></li>
<li><a href="#orgheadline44">6.2. this关键词</a></li>
<li><a href="#orgheadline45">6.3. hello方法</a></li>
<li><a href="#orgheadline46">6.4. name属性</a></li>
<li><a href="#orgheadline47">6.5. 集合</a></li>
<li><a href="#orgheadline48">6.6. Date对象</a></li>
<li><a href="#orgheadline49">6.7. 参考资料</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline1">前言</h2>
<div class="outline-text-2" id="text-1">
<p>
本文主要面向那些已经熟悉一门编程语言的读者，并不十分适合编程初学者来阅读。
</p>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline31">javascript语言简介</h2>
<div class="outline-text-2" id="text-2">
</div><div class="outline-3">
<h3 id="orgheadline2">注释</h3>
<div class="outline-text-3" id="text-2-1">
<p>
用 <code>//</code> 来标记一行注释。
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
用 <code>/*   */</code> 来标记多行注释，不过用 <code>//</code> 来标记多行注释也是可以的，这个看编辑器方不方便。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline3">javascript代码放在那里</h3>
<div class="outline-text-3" id="text-2-2">
<p>
javascript的代码一般推荐是放在 <code>&lt;/body&gt;</code> 之前，这样能够让浏览器更快地加载页面。至于其他倒没有特别的要求，刚开始简单的javascript代码就直接写上去也是可以的:
</p>

<pre>
&lt;script&gt;
your awesome javascript code
&lt;/script&gt;
&lt;/body&gt;
</pre>

<p>
这样更方便早期的调试。如果javascript代码量有一点了那么当然还是推荐另外单独放在一个js文件上，然后如下引入进来:
</p>
<pre>
&lt;script src="where"&gt;&lt;/script&gt;
</pre>

<p>
然后一个网页内如果没有特别的理由的话，那么javascript代码最好就放在一个文件里面，方便网页加载。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline4">alert函数</h3>
<div class="outline-text-3" id="text-2-3">
<p>
弹出一段警告信息
</p>
<pre>
alert("hello")
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline5">console.log函数</h3>
<div class="outline-text-3" id="text-2-4">
<p>
不同于alert函数，这个函数是在开发者工具的控制台那里显示。更加方便调试和debug javascript程序。
</p>
<pre>
console.log("hello")
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline6">confirm函数</h3>
<div class="outline-text-3" id="text-2-5">
<p>
弹出一个对话框，可以和用户互动点击确定或取消。根据用户的点击返回true或false。
</p>
<pre>
confirm('This is an example of using JS to create some interaction on a website. Click OK to continue!');
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline7">prompt函数</h3>
<div class="outline-text-3" id="text-2-6">
<p>
弹出一个对话框，具体是一个输入框，输入的值就是该函数的返回值。
</p>
<pre>
var age = prompt("what's your age");
</pre>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline8">数据类型简介</h3>
<div class="outline-text-3" id="text-2-7">
<p>
数值型，字符串型（javascript同python一样单引号双引号都可以），布尔型（javascript是 <code>true</code> 和 <code>false</code> ），然后其他常规数值运算和逻辑运算（如 <code>&amp;&amp;</code> <code>||</code> <code>!</code> 之类）和比较运算（这里值得一提的是和python的 <code>==</code> 对应的javascript的比较运算符应该是 <code>===</code> ，三个等号，这算是javascript的一个历史遗留语法瑕疵问题。）等都大体相同。python中的None对应的是javascript的 <code>null</code> 。
</p>

<p>
然后高级数据类型各个编程语言差异就很大了，不过javascript似乎和python在基本高级数据类型上也很接近，比如说javascript的数组就类似于python的列表:
</p>
<pre>
[1, 2, 3.14, 'Hello', null, true];
</pre>

<p>
其索引index编号法则也和python一致。
</p>

<p>
然后javascript还有一个什么对象的概念，其大体可以看作python中的字典类型。
</p>
<pre>
var person = {
    name: 'Bob',
    age: 20,
    tags: ['js', 'web', 'mobile'],
    city: 'Beijing',
    zipcode: null
};
</pre>

<p>
如下所示具体调用各个数值也是类似的:
</p>
<pre>
person['name']
"Bob"
person.name
"Bob"
</pre>
</div>
</div>




<div class="outline-3">
<h3 id="orgheadline9">声明变量</h3>
<div class="outline-text-3" id="text-2-8">
<p>
很多资料都会谈论这个问题，javascript代码声明变量都推荐加上 <code>var</code> 这个关键词，如下所示。
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录
<p>
这样的话变量的作用域就很符合我们在其他编程语言中的常识，比如在函数里面就是局部变量等。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline10">typeof函数</h3>
<div class="outline-text-3" id="text-2-9">
<p>
相当于python中的 <code>type</code> 函数，查看某个对象的对象类型。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline11">数值型简介</h3>
<div class="outline-text-3" id="text-2-10">
<p>
javascript整数和浮点数都不分了，都统一表示为Number，然后数值型那些运算，比如加减乘除之类的就不用多说了。其中 <code>%</code> 和python一样也是求余操作。在python3中有 <code>5//2</code> 是求商的概念，javascript没有这个概念，我们需要如下来获得类似的效果。
</p>

<pre>
console.log(parseInt(5/2))
</pre>
</div>
</div>
