电脑/html5/javascript语言/javascript语言学习基础篇.html


<div class="outline-3">
<h3 id="orgheadline14">字符串型简介</h3>
<div class="outline-text-3" id="text-2-11">
<p>
javascript的字符串类型和python非常类似，比如 <code>string[0]</code> 是支持的。然后不可以这样用string[0:2]，幸运的是javascript提供了类似python中的那种切片概念，就是使用 <code>slice</code> 方法
</p>

<pre>
console.log("hello".slice(0,2))
console.log([1,3,4,5].slice(0,2))
</pre>

<p>
不过javascript的slice方法和python的切片操作还是有点区别的，其只有 <code>(start,end)</code> 两个参数，然后其也有负数从末尾算起的概念，不过其不会倒着来，都是从左到右的那种顺序。具体请参看 <a href="http://www.w3school.com.cn/jsref/jsref_slice_string.asp">这里</a> 。
</p>
</div>

<div class="outline-4">
<h4 id="orgheadline12">多行字符串</h4>
<div class="outline-text-4" id="text-2-11-1">
<p>
这个对应的是python的 ''' 三引号情况。javascript是这样表示的:
</p>

<pre>
`多行
字符串
`
</pre>

<p>
即使用那个反斜点符号包围之。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline13">字符串的一些方法清单</h4>
<div class="outline-text-4" id="text-2-11-2">
<dl class="org-dl">
<dt>length</dt><dd>字符串长度</dd>
<dt>toUpperCase</dt><dd>变成大写</dd>
<dt>toLowerCase</dt><dd>变成小写</dd>
<dt>indexOf</dt><dd>返回子字符串出现的索引位置，index索引编号规则和python相同。</dd>
<dt>substring</dt><dd>返回子字符串，如果熟悉python的那种切片规则的话，那么推荐就直接使用 <code>slice</code> 方法。</dd>
</dl>
</div>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline17">数组</h3>
<div class="outline-text-3" id="text-2-12">
<p>
对应于python中的列表，javascript这里称为数组。如下所示我们看到其也是可变的。
</p>
<pre>
lst
[1, 2, 3, 4, 5]
lst[0] = 2
2
lst
[2, 2, 3, 4, 5]
</pre>
</div>

<div class="outline-4">
<h4 id="orgheadline15">数组的一些方法清单</h4>
<div class="outline-text-4" id="text-2-12-1">
<dl class="org-dl">
<dt>length</dt><dd>数组长度</dd>
<dt>indexOf</dt><dd>返回数组某个子元素的索引位置</dd>
<dt>slice</dt><dd>切片操作，类似于python的 <code>lst[0:2]</code> 那种表达方法。</dd>
<dt>push</dt><dd>末尾添加一个元素</dd>
<dt>pop</dt><dd>最后一个元素删除</dd>
<dt>unshift</dt><dd>数组头部添加一个或多个元素，返回新数组的长度</dd>
<dt>shift</dt><dd>数组头部删除一个元素</dd>
<dt>sort</dt><dd>排序，破坏型。值得一提的是对于数字排序并不是按照从大到小的顺序来的，不太清楚为何:</dd>
</dl>

<pre>
&gt; var lst = [1,5,2,3,51,4,45,545,541,48,77]
undefined
&gt; lst.sort()
[ 1,
  2,
  3,
  4,
  45,
  48,
  5,
  51,
  541,
  545,
  77 ]
</pre>

<p>
在python中最多说字符串就这样，但这里是number类型啊。然后要正常排序，我们需要如下操作（参看 <a href="http://www.w3school.com.cn/jsref/jsref_sort.asp">这个网页</a> ）:
</p>

<pre>
var lst = [1,5,2,3,51,4,45,545,541,48,77]
function sortNumber(a,b){
    return a - b
}
lst.sort(sortNumber)
alert(lst)
</pre>

<p>
这里sort方法接受一个函数参数，这个函数接受两个参量，用来判断a和b的值大小，如果返回值小于0，则a放在前面。如果返回值大于0，则a放在后面。这种排序方法也支持数字字符串的情况。javascript在处理这种 <code>字符串 - 字符串</code> 的情况是会尝试做转换成number类型的才做。 
</p>

<dl class="org-dl">
<dt>reverse</dt><dd>反转，破坏型。</dd>
<dt>splice</dt><dd>从指定的索引删除某些元素，然后在此处添加某些元素，相当于update更新了。</dd>
</dl>
<pre>
&gt; var arr = ['Microsoft', 'Apple', 'Yahoo', 'AOL', 'Excite', 'Oracle'];
undefined
&gt; arr.splice(2, 3, 'Google', 'Facebook'); 
["Yahoo", "AOL", "Excite"]
&gt; arr
["Microsoft", "Apple", "Google", "Facebook", "Oracle"]
</pre>
<p>
参数意思是从索引2开始删除3个元素，然后添加后面的元素。从上面的例子可以看出splice方法是破坏型的方法，然后其返回的是删除了的那是那个元素。
</p>

<p>
splice方法也可以用于只删除不添加也就是纯删除操作，或只添加不删除的纯添加操作。
</p>

<pre>
// 只删除,不添加:
arr.splice(2, 2);
// 只添加,不删除:
arr.splice(2, 0, 'Google', 'Facebook');
</pre>

<dl class="org-dl">
<dt>concat</dt><dd>连接两个数组，非破坏型。</dd>
</dl>
<pre>
&gt; var lst1 = [1,2,3]
undefined
&gt; var lst2 = ['a','b','c']
undefined
&gt; lst1.concat(lst2)
[1, 2, 3, "a", "b", "c"]
</pre>

<dl class="org-dl">
<dt>join</dt><dd>类似于python字符串的join方法，如下所示:</dd>
</dl>
<pre>
var arr = ['A', 'B', 'C', 1, 2, 3];
arr.join('-'); // 'A-B-C-1-2-3'
</pre>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline16">比较两个数组是否相同</h4>
<div class="outline-text-4" id="text-2-12-2">
<p>
参考了 <a href="http://stackoverflow.com/questions/3115982/how-to-check-if-two-arrays-are-equal-with-javascript">这个网页</a> 。
</p>

/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录
</div>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline21">对象类型简介</h3>
<div class="outline-text-3" id="text-2-13">
<p>
其大致可以对应到python中的字典的概念。
</p>
<pre>
var person = {
    name: 'Bob',
    age: 20,
    tags: ['js', 'web', 'mobile'],
    city: 'Beijing',
    zipcode: null
};
</pre>

<p>
javascript的对象的value还可以是某个函数，这样的话其实际上就类似于python中的类一样，成了一个方法了。然后类似python的self，其也有一个 <code>this</code> 关键词来表示本对象实例。
</p>
</div>



<div class="outline-4">
<h4 id="orgheadline18">in语句</h4>
<div class="outline-text-4" id="text-2-13-1">
<pre>
'name' in xiaoming;
</pre>
<pre>
&gt; var d = {}
undefined
&gt; d['a'] = 1
1
&gt; d
Object {a: 1}
&gt; 'a' in d
true
&gt; 1 in [1,2,3]
true
</pre>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline19">delete语句</h4>
<div class="outline-text-4" id="text-2-13-2">
<p>
其对应的就是python的del语句。然后我们看到javascript的 <code>delete</code> 语句删除不存在键也不会报错。
</p>
<pre>
&gt; d
Object {a: 1}
&gt; delete(d.b)
true
&gt; d
Object {a: 1}
&gt; delete(d.a)
true
&gt; d
Object {}
</pre>
</div>
</div>


<div class="outline-4">
<h4 id="orgheadline20">hasOwnProperty方法</h4>
<div class="outline-text-4" id="text-2-13-3">
<p>
对应于python2的has_key方法，不过python2已经移除了，推荐用in语句。
</p>
<pre>
d = {'a':1}
Object {a: 1}
d.hasOwnProperty('a')
true
</pre>
</div>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline22">布尔值</h3>
<div class="outline-text-3" id="text-2-14">
<p>
javascript的布尔值是 <code>true</code> 和 <code>false</code> 。然后需要额外强调的是，类似python的比较判断（==）符号在javascript中是 <code>===</code> ，三个等号，这不是什么别出心裁，也没有任何实际的好处，就是javascript的历史遗留问题罢了。
</p>
<pre>
=== Equal to
!== Not equal to
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline23">null</h3>
<div class="outline-text-3" id="text-2-15">
<p>
javascript的是 <code>null</code> 。其也是一个单独的对象。类似于python的 <code>None</code> ，然后还有一个什么 <code>undefined</code> 。比如函数没有明确return值就会默认返回 <code>undefined</code> ，感兴趣的可能查一下这两个的区别，我看了一下，觉得挺无聊的。上面谈到 <code>==</code> 和 <code>===</code> 的区别，如果用 <code>===</code> ，则 <code>undefined</code> 是不等于 <code>null</code> 的，如果用 <code>==</code> ，则javascript会额外做一些类型转换工作，这两个又会看作相等的。所以一个简单的做法就是:
</p>
<pre>
result == null
</pre>

<p>
那些可能undefined的情况都视作null来处理之。
</p>
</div>
</div>
