电脑/html5/javascript语言/javascript语言学习基础篇.md

## 字符串型简介<a id="orgheadline16"></a>

javascript的字符串类型和python非常类似，比如 `string[0]` 是支持的。然后不可以这样用string[0:2]，幸运的是javascript提供了类似python中的那种切片概念，就是使用 `slice` 方法

    console.log("hello".slice(0,2))
    console.log([1,3,4,5].slice(0,2))

不过javascript的slice方法和python的切片操作还是有点区别的，其只有 `(start,end)` 两个参数，然后其也有负数从末尾算起的概念，不过其不会倒着来，都是从左到右的那种顺序。具体请参看 [这里](http://www.w3school.com.cn/jsref/jsref_slice_string.asp) 。

### 多行字符串<a id="orgheadline13"></a>

这个对应的是python的 ''' 三引号情况。javascript是这样表示的:

    `多行
    字符串
    `

即使用那个反斜点符号包围之。

### 字符串的一些方法清单<a id="orgheadline14"></a>

-   **length:** 字符串长度
-   **toUpperCase:** 变成大写
-   **toLowerCase:** 变成小写
-   **indexOf:** 返回子字符串出现的索引位置，index索引编号规则和python相同。
-   **substring:** 返回子字符串，如果熟悉python的那种切片规则的话，那么推荐就直接使用 `slice` 方法。

### toString方法<a id="orgheadline15"></a>

javascript的数值、布尔值、对象和字符串都有一个 `toString` 方法，大体类似于python的 `str` 函数。不过推荐类似的也使用 `String` 来将某个javascript对象转变成为字符串。

## 数组<a id="orgheadline19"></a>

对应于python中的列表，javascript这里称为数组。如下所示我们看到其也是可变的。

    lst
    [1, 2, 3, 4, 5]
    lst[0] = 2
    2
    lst
    [2, 2, 3, 4, 5]

### 数组的一些方法清单<a id="orgheadline17"></a>

-   **length:** 数组长度
-   **indexOf:** 返回数组某个子元素的索引位置
-   **slice:** 切片操作，类似于python的 `lst[0:2]` 那种表达方法。
-   **push:** 末尾添加一个元素
-   **pop:** 最后一个元素删除
-   **unshift:** 数组头部添加一个或多个元素，返回新数组的长度
-   **shift:** 数组头部删除一个元素
-   **sort:** 排序，破坏型。值得一提的是对于数字排序并不是按照从大到小的顺序来的，不太清楚为何:

    > var lst = [1,5,2,3,51,4,45,545,541,48,77]
    undefined
    > lst.sort()
    [ 1,
      2,
      3,
      4,
      45,
      48,
      5,
      51,
      541,
      545,
      77 ]

在python中最多说字符串就这样，但这里是number类型啊。然后要正常排序，我们需要如下操作（参看 [这个网页](http://www.w3school.com.cn/jsref/jsref_sort.asp) ）:

    var lst = [1,5,2,3,51,4,45,545,541,48,77]
    function sortNumber(a,b){
        return a - b
    }
    lst.sort(sortNumber)
    alert(lst)

这里sort方法接受一个函数参数，这个函数接受两个参量，用来判断a和b的值大小，如果返回值小于0，则a放在前面。如果返回值大于0，则a放在后面。这种排序方法也支持数字字符串的情况。javascript在处理这种 `字符串 - 字符串` 的情况是会尝试做转换成number类型的才做。 

-   **reverse:** 反转，破坏型。
-   **splice:** 从指定的索引删除某些元素，然后在此处添加某些元素，相当于update更新了。

    > var arr = ['Microsoft', 'Apple', 'Yahoo', 'AOL', 'Excite', 'Oracle'];
    undefined
    > arr.splice(2, 3, 'Google', 'Facebook'); 
    ["Yahoo", "AOL", "Excite"]
    > arr
    ["Microsoft", "Apple", "Google", "Facebook", "Oracle"]

参数意思是从索引2开始删除3个元素，然后添加后面的元素。从上面的例子可以看出splice方法是破坏型的方法，然后其返回的是删除了的那是那个元素。

splice方法也可以用于只删除不添加也就是纯删除操作，或只添加不删除的纯添加操作。

    // 只删除,不添加:
    arr.splice(2, 2);
    // 只添加,不删除:
    arr.splice(2, 0, 'Google', 'Facebook');

-   **concat:** 连接两个数组，非破坏型。

    > var lst1 = [1,2,3]
    undefined
    > var lst2 = ['a','b','c']
    undefined
    > lst1.concat(lst2)
    [1, 2, 3, "a", "b", "c"]

-   **join:** 类似于python字符串的join方法，如下所示:

    var arr = ['A', 'B', 'C', 1, 2, 3];
    arr.join('-'); // 'A-B-C-1-2-3'

### 比较两个数组是否相同<a id="orgheadline18"></a>

参考了 [这个网页](http://stackoverflow.com/questions/3115982/how-to-check-if-two-arrays-are-equal-with-javascript) 。

```js
function arraysEqual(a, b) {
  if (a === b) return true;
  if (a == null || b == null) return false;
  if (a.length != b.length) return false;

  // If you don't care about the order of the elements inside
  // the array, you should sort both arrays here.

  for (var i = 0; i &lt; a.length; ++i) {
    if (a[i] !== b[i]) return false;
  }
  return true;
}
```

## 对象类型简介<a id="orgheadline23"></a>

其大致可以对应到python中的字典的概念。

    var person = {
        name: 'Bob',
        age: 20,
        tags: ['js', 'web', 'mobile'],
        city: 'Beijing',
        zipcode: null
    };

javascript的对象的value还可以是某个函数，这样的话其实际上就类似于python中的类一样，成了一个方法了。然后类似python的self，其也有一个 `this` 关键词来表示本对象实例。

### in语句<a id="orgheadline20"></a>

    'name' in xiaoming;

    > var d = {}
    undefined
    > d['a'] = 1
    1
    > d
    Object {a: 1}
    > 'a' in d
    true
    > 1 in [1,2,3]
    true

### delete语句<a id="orgheadline21"></a>

其对应的就是python的del语句。然后我们看到javascript的 `delete` 语句删除不存在键也不会报错。

    > d
    Object {a: 1}
    > delete(d.b)
    true
    > d
    Object {a: 1}
    > delete(d.a)
    true
    > d
    Object {}

### hasOwnProperty方法<a id="orgheadline22"></a>

对应于python2的has\_key方法，不过python2已经移除了，推荐用in语句。

    d = {'a':1}
    Object {a: 1}
    d.hasOwnProperty('a')
    true

## 布尔值<a id="orgheadline24"></a>

javascript的布尔值是 `true` 和 `false` 。然后需要额外强调的是，类似python的比较判断（==）符号在javascript中是 `===` ，三个等号，这不是什么别出心裁，也没有任何实际的好处，就是javascript的历史遗留问题罢了。

    === Equal to
    !== Not equal to

## null<a id="orgheadline25"></a>

javascript的是 `null` 。其也是一个单独的对象。类似于python的 `None` ，然后还有一个什么 `undefined` 。比如函数没有明确return值就会默认返回 `undefined` ，感兴趣的可能查一下这两个的区别，我看了一下，觉得挺无聊的。上面谈到 `==` 和 `===` 的区别，如果用 `===` ，则 `undefined` 是不等于 `null` 的，如果用 `==` ，则javascript会额外做一些类型转换工作，这两个又会看作相等的。所以一个简单的做法就是:

    result == null

那些可能undefined的情况都视作null来处理之。
