电脑/html5/javascript语言/javascript语言学习基础篇.org
** 条件判断结构
条件判断结构，和python大同小异，除了那些圆括号（记住这个圆括号必须加上）和花括号。
#+BEGIN_SRC js
var feedback = 10
if(feedback > 8){
    console.log("Thank you! We should race at the next concert!")}
else{
    console.log("I'll keep practicing coding and racing.")}
#+END_SRC

虽然javascript不像python那样强制缩进风格，但还是推荐用缩进来增强你的代码可读性和逻辑清晰性，如:
#+BEGIN_SRC js
age = 20
if(age < 6){
    console.log('kid')}
else if(age >= 18){
    console.log('adult')}
else{
    console.log('teenager')}
#+END_SRC

这种写法使得代码更加接近python风格，然后我们可以把第一个花括号视作python缩进区块开始的冒号，然后后面的花括号视作某个区块部分语句结束的标识。

所以我们下面写一个更加复杂点的例子（具体这些小脚本的试验推荐在ubuntu下安装nodejs，然后执行 ~nodejs test.js~ 即可。）。原python脚本如下:
#+BEGIN_SRC python
x=-2
if x>0:
    print('x大于0')
    if x>2:
        print('x>2')
    elif x<2:
        print('0<x<2')
    else:
        print('x=2')
elif x<0:
    print('x小于0')
else:
    print('x等于0')
#+END_SRC

改写成为:
#+BEGIN_SRC js
var x = -1
if(x>0){
    console.log('x大于0')
    if(x>2){
        console.log('x>2')}
    else if(x<2){
        console.log('0<x<2')}
    else{
        console.log('x=2')}}
else if(x<0){
    console.log('x小于0')}
else{
    console.log('x等于0')}
#+END_SRC

读者可以用不同的x值来测试一下，这里的关键性问题不是区块开始那里，而是区块什么时候结束。然后就是程序结构最好清清晰晰的用 if else 或者 if else if else if else 等这类语句表达出来。关于多个else if语句的组合平行表达，读者可以自己试验一下，我简单写了下面这个例子:
#+BEGIN_SRC js
age = 5
if(age < 6){
    console.log('age 小于 6')}
else if(age >= 25){
    console.log('age 大于等于 25')}
else if(age >= 18){
    console.log('age 大于等于18且小于25')}
else{
    console.log('age 大于等于6且小于18')}
#+END_SRC

javascript有switch语句，作为我们pythoner你懂的，用多个else if语句也是可以的。

** 循环结构
javascript和python都有while语句，但while语句用的较少，更多的是使用for语句。javascript的for语句老式风格和c语句接近，而现在有新式的for语句风格了，更接近python的风格。如下所示:

#+BEGIN_SRC js
for(var i in [1,2,3]){
    console.log(i)}
#+END_SRC

需要注意的有两点: 一是括号和花括号；二是变量的var声明（记得javascript里面不管是本地变量还是全局变量等，只要名字是新出来的，都要var声明一下）。

然后递归遍历字典的key也是可以的:
#+BEGIN_SRC js
for(var i in {'a':1,'b':2}){
    console.log(i)}
#+END_SRC

*** while语句
while语句简单了解下吧，熟悉c语言的简单看一下就清楚了。

#+BEGIN_SRC js
var x = 0;
var n = 99;
while (n > 0) {
    x = x + n;
    n = n - 2;
}
#+END_SRC

还有do while 语句

#+BEGIN_SRC js
var n = 0;
do {
    n = n + 1;
}while (n < 100);

#+END_SRC


** 定义函数
一个简单的函数定义和使用如下所示:
#+BEGIN_EXAMPLE
var greeting = function(name){
    console.log(name);
}
greeting('hello')
#+END_EXAMPLE
我们看到javascript明确将函数名作为一个变量，这是唯一要值得注意的，不过你也可以采用这种写法，这样更加为我们所熟悉了:
#+BEGIN_SRC js
function abs(x){
    if(x >= 0){
        return x;} 
    else{
        return -x;}
}
#+END_SRC

这两种定义风格是完全等价的。这里值得一提的是如果函数没有确定return值，则视作返回的undefined。

** arguments用法
javascript的函数内部可以直接使用arguments这个变量，其不是一个Array，但可以如下使用:
#+BEGIN_EXAMPLE
arguments[0]
arguments.length
#+END_EXAMPLE
其会接受传入函数的所有参量。

** rest用法
这个有点类似于lisp语言的rest参量控制概念，也就是如下
#+BEGIN_EXAMPLE
function func(a,b,...rest){
    console.log(rest)
}
#+END_EXAMPLE
rest是表示除了a和b之外的所有其余参量。注意前面三个点号: ~...rest~ 。




** 箭头函数
就是匿名函数lambda的一种写法。暂时不太关心、


* 面向DOM的操作
如果读者熟悉python的beautifulsoup或者类似的爬取网页领域，那么对于javascript所谈论的DOM是个什么东西是无需多言的。下面开始介绍那些对象吧。


** window
window是一个全局变量，表示本浏览器的窗口。

- innerWidth :: 本窗口的内部宽度，所谓的内部宽度是指除去菜单栏工具栏等具体显示网页的净宽度。
- innerHeight :: 本窗口的内部高度，内部高度含义类似上面谈及的内部宽度。
- outerWidth :: 本窗口的外部宽度
- outerHeight :: 本窗口的外部高度

** navigator
其有属性如下所示:
- appName :: 浏览器名称；
- appVersion :: 浏览器版本；
- language :: 浏览器设置的语言；
- platform :: 操作系统类型；
- userAgent :: 浏览器设定的User-Agent字符串。

** screen
- width :: 屏幕宽度
- height :: 屏幕高度
- colorDepth :: 颜色位数

** location
- href :: 完整路径
- protocol :: 如下所示:
#+BEGIN_EXAMPLE
> location.protocol
"http:"
#+END_EXAMPLE

- host :: 对应python urlsplit之后的netloc
- port :: 端口号
- pathname :: 对应python urlsplit之后的path
- search :: 参数字段
- hash :: 也就是segement

------

- assign() :: 刷新当前页面
- reload() :: 重载当前页面

** document
你可以认为这是beautifulsoup刷过之后的网页文档树，这是以后我们操作文档的主要交互对象。比如简单的写入html代码:
#+BEGIN_SRC js
document.write("<h1>This is a heading</h1>");
document.write("<p>This is a paragraph.</p>");
#+END_SRC

这会在网页文档里面附加一些内容。

按钮点击一下则执行什么javascript代码。
#+BEGIN_SRC js
<button type="button" onclick="alert('Welcome!')">点击这里</button>
#+END_SRC

javascript改变HTML内容
#+BEGIN_SRC html
<script>
function myFunction()
{
x=document.getElementById("demo");  // 找到元素
x.innerHTML="Hello JavaScript!";    // 改变内容
}
</script>

<button type="button" onclick="myFunction()">点击这里</button>
#+END_SRC


- title :: title标签内所含的内容
- cookie :: 获取cookie的内容
- getElementById() :: 该方法用于根据Id来提取网页内容的某个DOM子节点
- getElementsByTagName() :: 该方法用于根据Tag标签名字来提取某个DOM子节点（看到那个Elements的s，其将返回多个命中目标。记住带s的这些将返回的是一个数组对象）
- getElementsByClassName() :: 该方法用于根据css来进行选择某些DOM子节点。

返回的所谓DOM子节点对象，可以如同document对象一样使用这三个方法，相当于在第一次查找结果之上进一步查找。

- querySelector() :: 类似beautifulsoup的selector选择语法:
#+BEGIN_EXAMPLE
var ps = q1.querySelectorAll('div.highlighted > p');
#+END_EXAMPLE
- querySelectorAll() :: 类似上面，但返回所有结果。


找到目标标签元素之后，各个样式属性可以如下直接引用:
#+BEGIN_EXAMPLE
document.querySelector('a').href
#+END_EXAMPLE

