电脑/html5/javascript语言/javascript语言学习基础篇.html



<div class="outline-3">
<h3 id="orgheadline24">条件判断结构</h3>
<div class="outline-text-3" id="text-2-16">
<p>
条件判断结构，和python大同小异，除了那些圆括号（记住这个圆括号必须加上）和花括号。
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
虽然javascript不像python那样强制缩进风格，但还是推荐用缩进来增强你的代码可读性和逻辑清晰性，如:
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
这种写法使得代码更加接近python风格，然后我们可以把第一个花括号视作python缩进区块开始的冒号，然后后面的花括号视作某个区块部分语句结束的标识。
</p>

<p>
所以我们下面写一个更加复杂点的例子（具体这些小脚本的试验推荐在ubuntu下安装nodejs，然后执行 <code>nodejs test.js</code> 即可。）。原python脚本如下:
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
改写成为:
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
读者可以用不同的x值来测试一下，这里的关键性问题不是区块开始那里，而是区块什么时候结束。然后就是程序结构最好清清晰晰的用 if else 或者 if else if else if else 等这类语句表达出来。关于多个else if语句的组合平行表达，读者可以自己试验一下，我简单写了下面这个例子:
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
javascript有switch语句，作为我们pythoner你懂的，用多个else if语句也是可以的。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline26">循环结构</h3>
<div class="outline-text-3" id="text-2-17">
<p>
javascript和python都有while语句，但while语句用的较少，更多的是使用for语句。javascript的for语句老式风格和c语句接近，而现在有新式的for语句风格了，更接近python的风格。如下所示:
</p>

/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
需要注意的有两点: 一是括号和花括号；二是变量的var声明（记得javascript里面不管是本地变量还是全局变量等，只要名字是新出来的，都要var声明一下）。
</p>

<p>
然后递归遍历字典的key也是可以的:
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录
</div>

<div class="outline-4">
<h4 id="orgheadline25">while语句</h4>
<div class="outline-text-4" id="text-2-17-1">
<p>
while语句简单了解下吧，熟悉c语言的简单看一下就清楚了。
</p>

/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
还有do while 语句
</p>

/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录
</div>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline27">定义函数</h3>
<div class="outline-text-3" id="text-2-18">
<p>
一个简单的函数定义和使用如下所示:
</p>
<pre>
var greeting = function(name){
    console.log(name);
}
greeting('hello')
</pre>
<p>
我们看到javascript明确将函数名作为一个变量，这是唯一要值得注意的，不过你也可以采用这种写法，这样更加为我们所熟悉了:
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
这两种定义风格是完全等价的。这里值得一提的是如果函数没有确定return值，则视作返回的undefined。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline28">arguments用法</h3>
<div class="outline-text-3" id="text-2-19">
<p>
javascript的函数内部可以直接使用arguments这个变量，其不是一个Array，但可以如下使用:
</p>
<pre>
arguments[0]
arguments.length
</pre>
<p>
其会接受传入函数的所有参量。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline29">rest用法</h3>
<div class="outline-text-3" id="text-2-20">
<p>
这个有点类似于lisp语言的rest参量控制概念，也就是如下
</p>
<pre>
function func(a,b,...rest){
    console.log(rest)
}
</pre>
<p>
rest是表示除了a和b之外的所有其余参量。注意前面三个点号: <code>...rest</code> 。
</p>
</div>
</div>




<div class="outline-3">
<h3 id="orgheadline30">箭头函数</h3>
<div class="outline-text-3" id="text-2-21">
<p>
就是匿名函数lambda的一种写法。暂时不太关心、
</p>
</div>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline40">面向DOM的操作</h2>
<div class="outline-text-2" id="text-3">
<p>
如果读者熟悉python的beautifulsoup或者类似的爬取网页领域，那么对于javascript所谈论的DOM是个什么东西是无需多言的。下面开始介绍那些对象吧。
</p>
</div>


<div class="outline-3">
<h3 id="orgheadline32">window</h3>
<div class="outline-text-3" id="text-3-1">
<p>
window是一个全局变量，表示本浏览器的窗口。
</p>

<dl class="org-dl">
<dt>innerWidth</dt><dd>本窗口的内部宽度，所谓的内部宽度是指除去菜单栏工具栏等具体显示网页的净宽度。</dd>
<dt>innerHeight</dt><dd>本窗口的内部高度，内部高度含义类似上面谈及的内部宽度。</dd>
<dt>outerWidth</dt><dd>本窗口的外部宽度</dd>
<dt>outerHeight</dt><dd>本窗口的外部高度</dd>
</dl>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline33">navigator</h3>
<div class="outline-text-3" id="text-3-2">
<p>
其有属性如下所示:
</p>
<dl class="org-dl">
<dt>appName</dt><dd>浏览器名称；</dd>
<dt>appVersion</dt><dd>浏览器版本；</dd>
<dt>language</dt><dd>浏览器设置的语言；</dd>
<dt>platform</dt><dd>操作系统类型；</dd>
<dt>userAgent</dt><dd>浏览器设定的User-Agent字符串。</dd>
</dl>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline34">screen</h3>
<div class="outline-text-3" id="text-3-3">
<dl class="org-dl">
<dt>width</dt><dd>屏幕宽度</dd>
<dt>height</dt><dd>屏幕高度</dd>
<dt>colorDepth</dt><dd>颜色位数</dd>
</dl>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline35">location</h3>
<div class="outline-text-3" id="text-3-4">
<dl class="org-dl">
<dt>href</dt><dd>完整路径</dd>
<dt>protocol</dt><dd>如下所示:</dd>
</dl>
<pre>
&gt; location.protocol
"http:"
</pre>

<dl class="org-dl">
<dt>host</dt><dd>对应python urlsplit之后的netloc</dd>
<dt>port</dt><dd>端口号</dd>
<dt>pathname</dt><dd>对应python urlsplit之后的path</dd>
<dt>search</dt><dd>参数字段</dd>
<dt>hash</dt><dd>也就是segement</dd>
</dl>

<hr >

<dl class="org-dl">
<dt>assign()</dt><dd>刷新当前页面</dd>
<dt>reload()</dt><dd>重载当前页面</dd>
</dl>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline39">document</h3>
<div class="outline-text-3" id="text-3-5">
<p>
你可以认为这是beautifulsoup刷过之后的网页文档树，这是以后我们操作文档的主要交互对象。比如简单的写入html代码:
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
这会在网页文档里面附加一些内容。
</p>

<p>
按钮点击一下则执行什么javascript代码。
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<p>
javascript改变HTML内容
</p>
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录


<dl class="org-dl">
<dt>title</dt><dd>title标签内所含的内容</dd>
<dt>cookie</dt><dd>获取cookie的内容</dd>
<dt>getElementById()</dt><dd>该方法用于根据Id来提取网页内容的某个DOM子节点</dd>
<dt>getElementsByTagName()</dt><dd>该方法用于根据Tag标签名字来提取某个DOM子节点（看到那个Elements的s，其将返回多个命中目标。记住带s的这些将返回的是一个数组对象）</dd>
<dt>getElementsByClassName()</dt><dd>该方法用于根据css来进行选择某些DOM子节点。</dd>
</dl>

<p>
返回的所谓DOM子节点对象，可以如同document对象一样使用这三个方法，相当于在第一次查找结果之上进一步查找。
</p>

<dl class="org-dl">
<dt>querySelector()</dt><dd>类似beautifulsoup的selector选择语法:</dd>
</dl>
<pre>
var ps = q1.querySelectorAll('div.highlighted &gt; p');
</pre>
<dl class="org-dl">
<dt>querySelectorAll()</dt><dd>类似上面，但返回所有结果。</dd>
</dl>


<p>
找到目标标签元素之后，各个样式属性可以如下直接引用:
</p>
<pre>
document.querySelector('a').href
</pre>
</div>
