电脑/html5/javascript语言/javascript语言学习基础篇.html

<div class="outline-4">
<h4 id="orgheadline36">getAttribute函数</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
找到元素之后我们可以使用 <code>getAttribute</code> 函数来获取其属性。比如获取title属性:
</p>
<pre>
object.getAttribute("title")
</pre>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline37">setAttribute函数</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
设置某个元素节点的属性值。
</p>

<pre>
object.setAttribute(attribute,value)
</pre>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline38">修改节点的文本内容</h4>
<div class="outline-text-4" id="text-3-5-3">
<dl class="org-dl">
<dt>innerHTML</dt><dd>对应该DOM节点标签内的文本内容</dd>
<dt>innerText</dt><dd>类似上面的innerHTML，但不可设置任何HTML标签</dd>
</dl>


<dl class="org-dl">
<dt>createElement()</dt><dd>创建一个标签元素对象:</dd>
</dl>
<pre>
var haskell = document.createElement('p');
haskell.id = 'haskell';
haskell.innerText = 'Haskell';
</pre>
<p>
上面的haskell具体内容就是: <code>&lt;p id=​"haskell"&gt;​Haskell​&lt;/p&gt;​</code> 。
</p>

<dl class="org-dl">
<dt>appendChild()</dt><dd>本标签元素为所谓的父节点，给自己添加一个子节点标签元素。（可以把找到的标签元素视作一个列表，然后执行append某个子节点操作）</dd>
<dt>insertBefore()</dt><dd>本标签元素为所谓的父节点，然后在其内的某个标签元素之前插入某个子节点标签元素:</dd>
</dl>
<pre>
parentElement.insertBefore(newElement, referenceElement);
</pre>
<dl class="org-dl">
<dt>insertAfter()</dt><dd>javascript原生没有，需要自己定义:</dd>
</dl>

/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录

<dl class="org-dl">
<dt>parentElement</dt><dd>返回本标签元素对象的父标签元素对象</dd>
<dt>removeChild()</dt><dd>本标签元素为父节点，删除本父节点的某个子节点</dd>
</dl>

<p>
但是实际使用中推荐用jquery来操作各个DOM节点。
</p>
</div>
</div>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline41">表单相关</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="http://www.liaoxuefeng.com/wiki/001434446689867b27157e896e74d51a89c25cc8b43bdb3000/001434499922277b890fd537901490a84fc24b2b8b8867e000">http://www.liaoxuefeng.com/wiki/001434446689867b27157e896e74d51a89c25cc8b43bdb3000/001434499922277b890fd537901490a84fc24b2b8b8867e000</a>
</p>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline42">AJAX技术</h2>
<div class="outline-text-2" id="text-5">
<p>
AJAX技术英文全名是: Asynchronous JavaScript and XML ，什么异步的JavaScript与XML技术。简单的了解就是网页开着，然后javascript开启了某个类似于python的requests模块的网页请求，一般是向本地的网页服务器发送的吧，但也可以跨站请求。然后其是异步的，如果不异步，那么网页阻塞了，用户无法继续阅读或点击了，这当然是不行的。
</p>

<p>
基本的使用过程是新建然后 <code>XMLHttpRequest()</code> 对象，然后通过这个对象来进行后续的操作。如下所示:
</p>

<pre>
var request = new XMLHttpRequest();
</pre>

<p>
然后就是定义request的行为:
</p>

<pre>
request.onreadystatechange = function(){
    do something;
}
</pre>

<p>
我们看得出来这是一个什么 <code>onreadystatechange</code> 事件，然后挂载了某个函数。然后request有如下几个 <code>readyState</code> 状态:
</p>

<ul class="org-ul">
<li>0 未初始化</li>
<li>1 正在加载</li>
<li>2 加载完毕</li>
<li>3 正在交互</li>
<li>4 完成</li>
</ul>

<p>
请求的HTTP状态码返回通过 <code>request.status</code> 获得，请求的响应文本通过 <code>request.responseText</code> 获得，此外还有一个 <code>responseXML</code> 属性，如果服务器响应是XML则用它。
</p>



<pre>
var request = new XMLHttpRequest(); // 新建XMLHttpRequest对象

request.onreadystatechange = function () { // 状态发生变化时，函数被回调
    if (request.readyState === 4) { // 成功完成
        // 判断响应结果:
        if (request.status === 200) {
            // 成功，通过responseText拿到响应的文本:
            return success(request.responseText);
        } else {
            // 失败，根据响应码判断失败原因:
            return fail(request.status);
        }
    } else {
        // HTTP请求还在继续...
    }
}

// 发送请求:
request.open('GET', '/api/categories');
request.send();
</pre>

<p>
然后就是通过request的 <code>open</code> 方法和 <code>send</code> 方法来实际发送请求了。比如 'GET'
</p>

<pre>
request.open('GET',url,true)
request.send()
</pre>

<p>
第三个参数是异步否，一般设置为true。
</p>

<p>
如果是 'POST' 则send还可以发送一些东西作为POST请求的额外数据。下面是来自w3school的一个例子:
</p>
<pre>
xmlhttp.open("POST","ajax_test.asp",true);
xmlhttp.setRequestHeader("Content-type","application/x-www-form-urlencoded");
xmlhttp.send("fname=Bill&amp;lname=Gates");
</pre>
<p>
这里的 <code>setRequestHeader</code> 是设置请求头的，然后send的是string字符串，也就是说我们想要发送json或者那种字典格式，是需要额外处理的。（我注意到jquery提供的data这个东西可以直接是字典值。）
</p>

<p>
然后在处理request过程，我们一般是需要等到readyState为4然后http状态码为200才进行某个动作，也就是廖雪峰的这个例子所展示的sucess情况:
</p>
<pre>
request.onreadystatechange = function () { // 状态发生变化时，函数被回调
    if (request.readyState === 4) { // 成功完成
        // 判断响应结果:
        if (request.status === 200) {
            // 成功，通过responseText拿到响应的文本:
            return success(request.responseText);
        } else {
            // 失败，根据响应码判断失败原因:
            return fail(request.status);
        }
    } else {
        // HTTP请求还在继续...
    }
}
</pre>

<p>
我注意到jquery里面有个sucess这个东西，应该对应的就是这里的success的情况，难怪jquery那么流行，就是ajax这里就带来了很大的便利，更不用提 <code>document. getElementById()</code> 等等那些冗长的语法了。关于jquery另外一篇文章讨论吧。
</p>
</div>
</div>





<div class="outline-2">
<h2 id="orgheadline50">附录</h2>
<div class="outline-text-2" id="text-6">
<p>
一些零碎的东西拾遗。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline43">windows加载事件</h3>
<div class="outline-text-3" id="text-6-1">
/bin/bash: /usr/local/bin/pygmentize: /usr/local/bin/python3.5: 解释器错误: 没有那个文件或目录
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline44">this关键词</h3>
<div class="outline-text-3" id="text-6-2">
<p>
this关键词的内容挺丰富的，总的来说this就是指对象本身:
</p>

<ol class="org-ol">
<li>this在函数内部表示本函数自身</li>
<li>如果在方法里面（这里强调方法是指对象的某个数值的值是函数对象），则this是本对象。</li>
</ol>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline45">hello方法</h3>
<div class="outline-text-3" id="text-6-3">
<p>
重定义hello方法相当于python的重定义 <code>__init__</code> 方法，其为该对象的重构函数，这样你就可以使用 <code>new</code> 来新建一个实例了。
</p>
<pre>
s = new Student('John')
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline46">name属性</h3>
<div class="outline-text-3" id="text-6-4">
<p>
name属性是一个特殊的属性，常用来表示该对象的名字。
</p>
</div>
</div>



<div class="outline-3">
<h3 id="orgheadline47">集合</h3>
<div class="outline-text-3" id="text-6-5">
<p>
javascript中的集合Set大体也和python中的集合概念相近。
</p>
<pre>
var s1 = new Set(); // 空Set
var s2 = new Set([1, 2, 3]); // 含1, 2, 3
</pre>

<p>
然后其也有 <code>add</code> 方法用于添加一个元素。用 <code>delete</code> 方法来删除某个元素。
</p>
</div>
</div>
