电脑/html5/javascript语言/javascript语言学习基础篇.md

### getAttribute函数<a id="orgheadline38"></a>

找到元素之后我们可以使用 `getAttribute` 函数来获取其属性。比如获取title属性:

    object.getAttribute("title")

### setAttribute函数<a id="orgheadline39"></a>

设置某个元素节点的属性值。

    object.setAttribute(attribute,value)

### 修改节点的文本内容<a id="orgheadline40"></a>

-   **innerHTML:** 对应该DOM节点标签内的文本内容
-   **innerText:** 类似上面的innerHTML，但不可设置任何HTML标签

-   **createElement():** 创建一个标签元素对象:

    var haskell = document.createElement('p');
    haskell.id = 'haskell';
    haskell.innerText = 'Haskell';

上面的haskell具体内容就是: `<p id=​"haskell">​Haskell​</p>​` 。

-   **appendChild():** 本标签元素为所谓的父节点，给自己添加一个子节点标签元素。（可以把找到的标签元素视作一个列表，然后执行append某个子节点操作）
-   **insertBefore():** 本标签元素为所谓的父节点，然后在其内的某个标签元素之前插入某个子节点标签元素:

    parentElement.insertBefore(newElement, referenceElement);

-   **insertAfter():** javascript原生没有，需要自己定义:

```js
function insertAfter(newElement, targetElement){
    var parent = targetElement.parentNode;
    if (parent.lastChild == targetElement){
        parent.appendChild(newElement);
    }
    else{
        parent.insertBefore(newElement, targetElement.nextSibling);
    }
}
```

-   **parentElement:** 返回本标签元素对象的父标签元素对象
-   **removeChild():** 本标签元素为父节点，删除本父节点的某个子节点

但是实际使用中推荐用jquery来操作各个DOM节点。

# 表单相关<a id="orgheadline43"></a>

<http://www.liaoxuefeng.com/wiki/001434446689867b27157e896e74d51a89c25cc8b43bdb3000/001434499922277b890fd537901490a84fc24b2b8b8867e000>

# AJAX技术<a id="orgheadline44"></a>

AJAX技术英文全名是: Asynchronous JavaScript and XML ，什么异步的JavaScript与XML技术。简单的了解就是网页开着，然后javascript开启了某个类似于python的requests模块的网页请求，一般是向本地的网页服务器发送的吧，但也可以跨站请求。然后其是异步的，如果不异步，那么网页阻塞了，用户无法继续阅读或点击了，这当然是不行的。

基本的使用过程是新建然后 `XMLHttpRequest()` 对象，然后通过这个对象来进行后续的操作。如下所示:

    var request = new XMLHttpRequest();

然后就是定义request的行为:

    request.onreadystatechange = function(){
        do something;
    }

我们看得出来这是一个什么 `onreadystatechange` 事件，然后挂载了某个函数。然后request有如下几个 `readyState` 状态:

-   0 未初始化
-   1 正在加载
-   2 加载完毕
-   3 正在交互
-   4 完成

请求的HTTP状态码返回通过 `request.status` 获得，请求的响应文本通过 `request.responseText` 获得，此外还有一个 `responseXML` 属性，如果服务器响应是XML则用它。

    var request = new XMLHttpRequest(); // 新建XMLHttpRequest对象
    
    request.onreadystatechange = function () { // 状态发生变化时，函数被回调
        if (request.readyState === 4) { // 成功完成
            // 判断响应结果:
            if (request.status === 200) {
                // 成功，通过responseText拿到响应的文本:
                return success(request.responseText);
            } else {
                // 失败，根据响应码判断失败原因:
                return fail(request.status);
            }
        } else {
            // HTTP请求还在继续...
        }
    }
    
    // 发送请求:
    request.open('GET', '/api/categories');
    request.send();

然后就是通过request的 `open` 方法和 `send` 方法来实际发送请求了。比如 'GET'

    request.open('GET',url,true)
    request.send()

第三个参数是异步否，一般设置为true。

如果是 'POST' 则send还可以发送一些东西作为POST请求的额外数据。下面是来自w3school的一个例子:

    xmlhttp.open("POST","ajax_test.asp",true);
    xmlhttp.setRequestHeader("Content-type","application/x-www-form-urlencoded");
    xmlhttp.send("fname=Bill&lname=Gates");

这里的 `setRequestHeader` 是设置请求头的，然后send的是string字符串，也就是说我们想要发送json或者那种字典格式，是需要额外处理的。（我注意到jquery提供的data这个东西可以直接是字典值。）

然后在处理request过程，我们一般是需要等到readyState为4然后http状态码为200才进行某个动作，也就是廖雪峰的这个例子所展示的sucess情况:

    request.onreadystatechange = function () { // 状态发生变化时，函数被回调
        if (request.readyState === 4) { // 成功完成
            // 判断响应结果:
            if (request.status === 200) {
                // 成功，通过responseText拿到响应的文本:
                return success(request.responseText);
            } else {
                // 失败，根据响应码判断失败原因:
                return fail(request.status);
            }
        } else {
            // HTTP请求还在继续...
        }
    }

我注意到jquery里面有个sucess这个东西，应该对应的就是这里的success的情况，难怪jquery那么流行，就是ajax这里就带来了很大的便利，更不用提 `document. getElementById()` 等等那些冗长的语法了。关于jquery另外一篇文章讨论吧。

# 附录<a id="orgheadline52"></a>

一些零碎的东西拾遗。

## windows加载事件<a id="orgheadline45"></a>

```js
function addLoadEvent(func){
    console.log("window onload event");
    var oldonload = window.onload;
    if (typeof window.onload != 'function'){
        window.onload = func;
    }
    else{
        window.onload = function (){
            oldonload();
            func();
        }
    }
}
```

## this关键词<a id="orgheadline46"></a>

this关键词的内容挺丰富的，总的来说this就是指对象本身:

1.  this在函数内部表示本函数自身
2.  如果在方法里面（这里强调方法是指对象的某个数值的值是函数对象），则this是本对象。

## hello方法<a id="orgheadline47"></a>

重定义hello方法相当于python的重定义 `__init__` 方法，其为该对象的重构函数，这样你就可以使用 `new` 来新建一个实例了。

    s = new Student('John')

## name属性<a id="orgheadline48"></a>

name属性是一个特殊的属性，常用来表示该对象的名字。

## 集合<a id="orgheadline49"></a>

javascript中的集合Set大体也和python中的集合概念相近。

    var s1 = new Set(); // 空Set
    var s2 = new Set([1, 2, 3]); // 含1, 2, 3

然后其也有 `add` 方法用于添加一个元素。用 `delete` 方法来删除某个元素。
