电脑/html5/javascript语言/javascript语言学习基础篇.html


<div class="outline-3">
<h3 id="orgheadline48">Date对象</h3>
<div class="outline-text-3" id="text-6-6">
<pre>
var now = new Date();
now; // Wed Jun 24 2015 19:49:22 GMT+0800 (CST)
now.getFullYear(); // 2015, 年份
now.getMonth(); // 5, 月份，注意月份范围是0~11，5表示六月
now.getDate(); // 24, 表示24号
now.getDay(); // 3, 表示星期三
now.getHours(); // 19, 24小时制
now.getMinutes(); // 49, 分钟
now.getSeconds(); // 22, 秒
now.getMilliseconds(); // 875, 毫秒数
now.getTime(); // 1435146562875, 以number形式表示的时间戳
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline49">参考资料</h3>
<div class="outline-text-3" id="text-6-7">
<ol class="org-ol">
<li><a href="https://www.codecademy.com/">https://www.codecademy.com/</a></li>
<li><a href="http://www.liaoxuefeng.com/wiki/001434446689867b27157e896e74d51a89c25cc8b43bdb3000">廖雪峰的javascript教程</a></li>
<li>javascript DOM编程艺术第二版: Jeremy Keith, Jeffrey Sambells著; 杨涛 王建桥 杨晓云等译.</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
